## Хранит глобальные значения и перечисления
extends Node

static func round_to_dec(num, digit):
	return round(num * pow(10.0, digit)) / pow(10.0, digit)
	
## Тип режима игры
enum GameMode {
	SANDBOX,
	CAMPAIGN
}
const DATA_ENEMY = {
	0: {
		hp = 65,
		speed = 155,
		money_death = 10.5
		},
	1: {
		hp = 80,
		speed = 145,
		money_death = 11
		},
	2: {
		hp = 80,
		speed = 160,
		money_death = 11.5
		},
	3: {
		hp = 130,
		speed = 200,
		money_death = 12
		},
	4: {
		hp = 135,
		speed = 120,
		money_death = 13
		},
	5: {
		hp = 135,
		speed = 210,
		money_death = 13
		},
	6: {
		hp = 200,
		speed = 220,
		money_death = 13
		},
	7: {
		hp = 400,
		speed = 150,
		money_death = 15.0
		}
}
## Тип атаки башен
enum TowerType {
	GUN = 0,
	AREA = 1,       ## урон по области
	SLOW = 2,        ## замедление
	MOVING = 3,      ## перемещение
	MONEY = 4,        ## генерация ресурсов
	POISON = 5        ## башня яда
}
## Редкость башен
enum Rarity {
	COMMON,    # Обычная
	RARE,      # Редкая
	EPIC,      # Эпическая
	LEGENDARY  # Легендарная
}
const LEVEL_OPEN_ABILITY = [7, 10]
const CHANCE_AGAIN_DAMAGE = 20
const PriseUnblockCard = {
	Rarity.COMMON: {
		prise_up_money = [500, 800, 500, 800, 500, 800, 500, 800, 500, 800],
		prise_up_card = [1, 3, 5, 10, 5, 10, 5, 10, 5, 10],
		abilit_prise = [1000, 500],
		open_card = 100,
		upgrade_for_session = [50.0, 75.0, 125.0, 200.0, 325.0, 525.0, 850.0,1375.0, 2225.0, 3600.0]
	},
	Rarity.RARE: {
		prise_up_money = [500, 800, 500, 800, 500, 800, 500, 800, 500, 800],
		prise_up_card = [0, 3, 5, 10, 5, 10, 5, 10, 5, 10],
		abilit_prise = [1000, 500],
		open_card = 100,
		upgrade_for_session = [50.0, 75.0, 125.0, 200.0, 325.0, 525.0, 850.0,1375.0, 2225.0, 3600.0]
	},
	Rarity.LEGENDARY: {
		prise_up_money = [500, 800, 500, 800, 500, 800, 500, 800, 500, 800],
		prise_up_card = [0, 3, 5, 10, 5, 10, 5, 10, 5, 10],
		abilit_prise = [1000, 500],
		open_card = 100,
		upgrade_for_session = [50.0, 75.0, 125.0, 200.0, 325.0, 525.0, 850.0,1375.0, 2225.0, 3600.0]
	}
}

const NUMBER_MAX_EFFECT_CARD: int = 4
const CHANCE_CRITICAL_DAMAGE: int = 5
const DATA_TOWER = {
	0: {
		type = Rarity.COMMON,
		type_attack = 0,
		type_explosion = 0,
		cost_in_session = 100,
		parametr_1 = {
			0: [30, 33.0, 36.3, 39.93, 43.92, 48.31, 53.14, 58.45, 64.3, 70.73],
			1: [33.0, 36.3, 39.93, 43.92, 48.31, 53.14, 58.45, 64.3, 70.73, 77.8],
			2: [36.3, 39.93, 43.92, 48.31, 53.14, 58.45, 64.3, 70.73, 77.8, 85.58],
			3: [39.93, 43.92, 48.31, 53.14, 58.45, 64.3, 70.73, 77.8, 85.58, 94.14],
			4: [43.92, 48.31, 53.14, 58.45, 64.3, 70.73, 77.8, 85.58, 94.14, 103.55],
			5: [48.32, 53.15, 58.47, 64.32, 70.75, 77.83, 85.61, 94.17, 103.59, 113.95],
			6: [53.15, 58.47, 64.32, 70.75, 77.83, 85.61, 94.17, 103.59, 113.95, 125.35],
			7: [58.46, 64.31, 70.74, 77.81, 85.59, 94.15, 103.57, 113.93, 125.32, 137.85],
			8: [64.31, 70.74, 77.81, 85.59, 94.15, 103.57, 113.93, 125.32, 137.85, 151.64],
			9: [70.74, 77.81, 85.59, 94.15, 103.57, 113.93, 125.32, 137.85, 151.64, 166.8]
		},
		parametr_2 = {
			0: [40, 44.0, 48.4, 53.24, 58.56, 64.42, 70.86, 77.95, 85.75, 94.33],
			1: [44.0, 48.4, 53.24, 58.56, 64.42, 70.86, 77.95, 85.75, 94.33, 103.76],
			2: [48.4, 53.24, 58.56, 64.42, 70.86, 77.95, 85.75, 94.33, 103.76, 114.14],
			3: [53.24, 58.56, 64.42, 70.86, 77.95, 85.75, 94.33, 103.76, 114.14, 125.55],
			4: [58.56, 64.42, 70.86, 77.95, 85.75, 94.33, 103.76, 114.14, 125.55, 138.11],
			5: [64.42, 70.86, 77.95, 85.75, 94.33, 103.76, 114.14, 125.55, 138.11, 151.92],
			6: [70.86, 77.95, 85.75, 94.33, 103.76, 114.14, 125.55, 138.11, 151.92, 167.11],
			7: [77.95, 85.75, 94.33, 103.76, 114.14, 125.55, 138.11, 151.92, 167.11, 183.82],
			8: [85.74, 94.31, 103.74, 114.11, 125.52, 138.07, 151.88, 167.07, 183.78, 202.16],
			9: [94.32, 103.75, 114.13, 125.54, 138.09, 151.9, 167.09, 183.8, 202.18, 222.4]
		},
		parametr_3 = [1.0, 0.97, 0.94, 0.91, 0.88, 0.85, 0.82, 0.79, 0.75, 0.7],
		parametr_4 = [245.0, 248.0, 251.0, 254.0, 257.0, 262.0, 268.0, 275.0, 282.0, 290.0],
		parametr_range = 4,
		name_label = ["", "", "с", "ед"],
		text = ["KEY_DAMAGE", "KEY_DAMAGE_REDUCTION", "KEY_RELOAD", "KEY_RANGE"],
		data = ["damage", "damage_reduction", "rof", "range"],
		img = ["res://.godot/imported/damage.png-872b5ccd784ae534d29ff2b790dfc3b4.ctex",
		"res://Assets/Icons/damage_reduction.png", 
		"res://.godot/imported/reload.png-640ae2fae7d793eb56d026ec5a460b96.ctex", 
		"res://.godot/imported/range.png-d3745379c73ab4ee989b44544ccbbc0e.ctex"],
		strateg = false,
		queue_free = [4, 5]
	},
	1: {
		type = Rarity.COMMON,
		type_attack = 1,
		type_explosion = 0,
		cost_in_session = 200,
		parametr_1 = {
			0: [45, 49.5, 54.45, 59.9, 65.89, 72.48, 79.73, 87.7, 96.47, 106.12],
			1: [49.5, 54.45, 59.9, 65.89, 72.48, 79.73, 87.7, 96.47, 106.12, 116.73],
			2: [54.45, 59.9, 65.89, 72.48, 79.73, 87.7, 96.47, 106.12, 116.73, 128.4],
			3: [59.9, 65.89, 72.48, 79.73, 87.7, 96.47, 106.12, 116.73, 128.4, 141.24],
			4: [65.88, 72.47, 79.72, 87.69, 96.46, 106.11, 116.72, 128.39, 141.23, 155.35],
			5: [72.47, 79.72, 87.69, 96.46, 106.11, 116.72, 128.39, 141.23, 155.35, 170.89],
			6: [79.72, 87.69, 96.46, 106.11, 116.72, 128.39, 141.23, 155.35, 170.89, 187.98],
			7: [87.69, 96.46, 106.11, 116.72, 128.39, 141.23, 155.35, 170.89, 187.98, 206.78],
			8: [96.46, 106.11, 116.72, 128.39, 141.23, 155.35, 170.89, 187.98, 206.78, 227.46],
			9: [106.11, 116.72, 128.39, 141.23, 155.35, 170.89, 187.98, 206.78, 227.46, 250.21]
		},
		parametr_2 = [1.05, 1.02, 0.99, 0.96, 0.93, 0.9, 0.82, 0.79, 0.75, 0.7],
		parametr_3 = [245.0, 248.0, 251.0, 254.0, 257.0, 262.0, 268.0, 275.0, 282.0, 290.0],
		parametr_4 = [1, 1, 2, 2, 3, 3, 4, 4, 5, 5],
		parametr_range = 3,
		name_label = ["", "ед", "с", "ед"],
		text = ["KEY_DAMAGE", "KEY_RELOAD", "KEY_RANGE", "KEY_TARGET"],
		data = ["damage", "rof", "range", "target"],
		img = ["res://.godot/imported/damage.png-872b5ccd784ae534d29ff2b790dfc3b4.ctex",
		"res://.godot/imported/reload.png-640ae2fae7d793eb56d026ec5a460b96.ctex", 
		"res://.godot/imported/range.png-d3745379c73ab4ee989b44544ccbbc0e.ctex",
		"res://Assets/Icons/target.png"],
		strateg = false,
		queue_free = [4, 5]
	},
	2: {
		type = Rarity.COMMON,
		type_attack = 0,
		type_explosion = 0,
		cost_in_session = 100,
		parametr_1 = {
			0: [10, 11.5, 13.22, 15.2, 17.48, 20.1, 23.11, 26.58, 30.57, 35.16],
			1: [11.5, 13.22, 15.2, 17.48, 20.1, 23.11, 26.58, 30.57, 35.16, 40.43],
			2: [13.22, 15.2, 17.48, 20.1, 23.11, 26.58, 30.57, 35.16, 40.43, 46.49],
			3: [15.21, 17.49, 20.11, 23.13, 26.6, 30.59, 35.18, 40.46, 46.53, 53.51],
			4: [17.49, 20.11, 23.13, 26.6, 30.59, 35.18, 40.46, 46.53, 53.51, 61.54],
			5: [20.11, 23.13, 26.6, 30.59, 35.18, 40.46, 46.53, 53.51, 61.54, 70.77],
			6: [23.13, 26.6, 30.59, 35.18, 40.46, 46.53, 53.51, 61.54, 70.77, 81.39],
			7: [26.6, 30.59, 35.18, 40.46, 46.53, 53.51, 61.54, 70.77, 81.39, 93.6],
			8: [30.59, 35.18, 40.46, 46.53, 53.51, 61.54, 70.77, 81.39, 93.6, 107.64],
			9: [35.18, 40.46, 46.53, 53.51, 61.54, 70.77, 81.39, 93.6, 107.64, 123.79]
		},
		parametr_2 = [1.0, 0.97, 0.94, 0.91, 0.88, 0.85, 0.82, 0.79, 0.75, 0.7],
		parametr_3 = {
			0: [2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5],
			1: [2.9, 2.9, 2.9, 2.9, 2.9, 2.9, 2.9, 2.9, 2.9, 2.9],
			2: [3.3, 3.3, 3.3, 3.3, 3.3, 3.3, 3.3, 3.3, 3.3, 3.3],
			3: [3.7, 3.7, 3.7, 3.7, 3.7, 3.7, 3.7, 3.7, 3.7, 3.7],
			4: [4.1, 4.1, 4.1, 4.1, 4.1, 4.1, 4.1, 4.1, 4.1, 4.1],
			5: [4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5],
			6: [4.9, 4.9, 4.9, 4.9, 4.9, 4.9, 4.9, 4.9, 4.9, 4.9],
			7: [5.3, 5.3, 5.3, 5.3, 5.3, 5.3, 5.3, 5.3, 5.3, 5.3],
			8: [5.7, 5.7, 5.7, 5.7, 5.7, 5.7, 5.7, 5.7, 5.7, 5.7],
			9: [6.1, 6.1, 6.1, 6.1, 6.1, 6.1, 6.1, 6.1, 6.1, 6.1]
		},
		parametr_4 = {
			0: [1.1, 1.1, 1.1, 1.1, 1.1, 1.1, 1.1, 1.1, 1.1, 1.1],
			1: [1.3, 1.3, 1.3, 1.3, 1.3, 1.3, 1.3, 1.3, 1.3, 1.3], 
			2: [1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5], 
			3: [1.7, 1.7, 1.7, 1.7, 1.7, 1.7, 1.7, 1.7, 1.7, 1.7], 
			4: [1.9, 1.9, 1.9, 1.9, 1.9, 1.9, 1.9, 1.9, 1.9, 1.9], 
			5: [2.1, 2.1, 2.1, 2.1, 2.1, 2.1, 2.1, 2.1, 2.1, 2.1], 
			6: [2.3, 2.3, 2.3, 2.3, 2.3, 2.3, 2.3, 2.3, 2.3, 2.3], 
			7: [2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5], 
			8: [2.7, 2.7, 2.7, 2.7, 2.7, 2.7, 2.7, 2.7, 2.7, 2.7], 
			9: [2.9, 2.9, 2.9, 2.9, 2.9, 2.9, 2.9, 2.9, 2.9, 2.9]
		},
		parametr_5 = [500, 505, 510, 520, 530, 535, 540, 545, 550, 555],
		parametr_6 = [230.0, 234.0, 238.0, 242.0, 246.0, 250.0, 254.0, 258.0, 262.0, 266.0],
		parametr_range = 6,
		name_label = ["", "с", "с", "с", "%", "ед"],
		text = ["KEY_DAMAGE", "KEY_RELOAD", "KEY_DURATION_PHASE_1", "KEY_DURATION_PHASE_2", "KEY_UP_ATTACK_SPEED", "KEY_RANGE"],
		data = ["damage", "rof", "duration_1", "duration_2", "up_attack_speed", "range"],
		img = ["res://.godot/imported/damage.png-872b5ccd784ae534d29ff2b790dfc3b4.ctex",
		"res://.godot/imported/reload.png-640ae2fae7d793eb56d026ec5a460b96.ctex",
		"res://Assets/Icons/hourglass.png",
		"res://Assets/Icons/hourglass.png",
		"res://Assets/Icons/damage_reduction.png",
		"res://.godot/imported/range.png-d3745379c73ab4ee989b44544ccbbc0e.ctex"],
		strateg = false,
		queue_free = []
	},
	3: {
		type = Rarity.COMMON,
		type_attack = 2,
		type_explosion = 0,
		cost_in_session = 100,
		parametr_1 = {
			0: [5.0, 5.5, 6.1, 6.7, 7.4, 8.1, 8.9, 9.8, 10.8, 11.9],
			1: [5.5, 6.1, 6.7, 7.4, 8.1, 8.9, 9.8, 10.8, 11.9, 13.1],
			2: [6.1, 6.7, 7.4, 8.1, 8.9, 9.8, 10.8, 11.9, 13.1, 14.4],
			3: [6.7, 7.4, 8.1, 8.9, 9.8, 10.8, 11.9, 13.1, 14.4, 15.8],
			4: [7.3, 8.0, 8.8, 9.7, 10.7, 11.8, 13.0, 14.3, 15.7, 17.3],
			5: [8.1, 8.9, 9.8, 10.8, 11.9, 13.1, 14.4, 15.8, 17.4, 19.1],
			6: [8.9, 9.8, 10.8, 11.9, 13.1, 14.4, 15.8, 17.4, 19.1, 21.0],
			7: [9.7, 10.7, 11.8, 13.0, 14.3, 15.7, 17.3, 19.0, 20.9, 23.0],
			8: [10.7, 11.8, 13.0, 14.3, 15.7, 17.3, 19.0, 20.9, 23.0, 25.3],
			9: [11.8, 13.0, 14.3, 15.7, 17.3, 19.0, 20.9, 23.0, 25.3, 27.8]
		},
		parametr_2 = {
			0: [1.0, 1.01, 1.02, 1.03, 1.04, 1.05, 1.06, 1.07, 1.08, 1.09],
			1: [1.01, 1.02, 1.03, 1.04, 1.05, 1.06, 1.07, 1.08, 1.09, 1.1],
			2: [1.02, 1.03, 1.04, 1.05, 1.06, 1.07, 1.08, 1.09, 1.1, 1.11],
			3: [1.03, 1.04, 1.05, 1.06, 1.07, 1.08, 1.09, 1.1, 1.11, 1.12],
			4: [1.04, 1.05, 1.06, 1.07, 1.08, 1.09, 1.1, 1.11, 1.12, 1.13],
			5: [1.05, 1.06, 1.07, 1.08, 1.09, 1.1, 1.11, 1.12, 1.13, 1.14],
			6: [1.06, 1.07, 1.08, 1.09, 1.1, 1.11, 1.12, 1.13, 1.14, 1.15],
			7: [1.07, 1.08, 1.09, 1.1, 1.11, 1.12, 1.13, 1.14, 1.15, 1.16],
			8: [1.08, 1.09, 1.1, 1.11, 1.12, 1.13, 1.14, 1.15, 1.16, 1.17],
			9: [1.09, 1.1, 1.11, 1.12, 1.13, 1.14, 1.15, 1.16, 1.17, 1.18]
		},
		parametr_3 = [1.5, 1.47, 1.44, 1.41, 1.38, 1.35, 1.32, 1.29, 1.25, 1.2],
		parametr_4 = [340.0, 350.0, 360.0, 370.0, 380.0, 390.0, 400.0, 410.0, 420.0, 430.0],
		parametr_range = 4,
		name_label = ["%", "с", "с", "ед"],
		text = ["KEY_INTENSIVITY", "KEY_DURATION", "KEY_RELOAD", "KEY_RANGE"],
		data = ["intensivity", "duration", "rof", "range"],
		img = ["res://.godot/imported/intensivity.png-1ce49c6ac50637b96205d06fd83040cd.ctex",
		"res://.godot/imported/duration.png-74d70b7c6b29a77461a04fd5357fe67f.ctex", 
		"res://.godot/imported/reload.png-640ae2fae7d793eb56d026ec5a460b96.ctex", 
		"res://.godot/imported/range.png-d3745379c73ab4ee989b44544ccbbc0e.ctex"],
		strateg = false,
		queue_free = [4, 5]
	},
	4: {
		type = Rarity.COMMON,
		type_attack = 3,
		type_explosion = 2,
		cost_in_session = 100,
		parametr_1 = {
			0: [500, 550.0, 605.0, 665.5, 732.05, 805.25, 885.78, 974.36, 1071.8, 1178.98],
			1: [550.0, 605.0, 665.5, 732.05, 805.25, 885.78, 974.36, 1071.8, 1178.98, 1296.88],
			2: [605.0, 665.5, 732.05, 805.25, 885.78, 974.36, 1071.8, 1178.98, 1296.88, 1426.57],
			3: [665.5, 732.05, 805.25, 885.78, 974.36, 1071.8, 1178.98, 1296.88, 1426.57, 1569.23],
			4: [732.05, 805.25, 885.78, 974.36, 1071.8, 1178.98, 1296.88, 1426.57, 1569.23, 1726.15],
			5: [805.26, 885.79, 974.37, 1071.81, 1178.99, 1296.89, 1426.58, 1569.24, 1726.16, 1898.78],
			6: [885.78, 974.36, 1071.8, 1178.98, 1296.88, 1426.57, 1569.23, 1726.15, 1898.77, 2088.65],
			7: [974.36, 1071.8, 1178.98, 1296.88, 1426.57, 1569.23, 1726.15, 1898.77, 2088.65, 2297.52],
			8: [1071.79, 1178.97, 1296.87, 1426.56, 1569.22, 1726.14, 1898.75, 2088.62, 2297.48, 2527.23],
			9: [1178.97, 1296.87, 1426.56, 1569.22, 1726.14, 1898.75, 2088.62, 2297.48, 2527.23, 2779.95]
		},
		parametr_2 = [4, 3.8, 3.61, 3.43, 3.26, 3.1, 2.94, 2.79, 2.65, 2.52],
		parametr_3 = [245.0, 248.0, 251.0, 254.0, 257.0, 262.0, 268.0, 275.0, 282.0, 290.0],
		parametr_range = 3,
		text = ["KEY_DISTANCE", "KEY_RELOAD", "KEY_RANGE"],
		data = ["distance", "rof", "range"],
		img = ["res://.godot/imported/distance.png-a3097e1cb8e56e338aba8f1c30601538.ctex",
		"res://.godot/imported/reload.png-640ae2fae7d793eb56d026ec5a460b96.ctex", 
		"res://.godot/imported/range.png-d3745379c73ab4ee989b44544ccbbc0e.ctex"],
		strateg = true,
		queue_free = [3, 4, 5]
	},
	5: {
		type = Rarity.COMMON,
		type_attack = 0,
		type_explosion = 0,
		cost_in_session = 100,
		parametr_1 = {
			1: [45.0, 72.0, 115.0, 184.0, 295.0, 475.0, 765.0, 1238.0, 2006.0, 3250.0],
			2: [45.0, 72.0, 115.0, 184.0, 295.0, 475.0, 765.0, 1238.0, 2006.0, 3250.0]
		},
		parametr_2 = {
			1: [45.0, 72.0, 115.0, 184.0, 295.0, 475.0, 765.0, 1238.0, 2006.0, 3250.0],
			2: [45.0, 72.0, 115.0, 184.0, 295.0, 475.0, 765.0, 1238.0, 2006.0, 3250.0]
		},
		parametr_3 = [245.0, 248.0, 251.0, 254.0, 257.0, 262.0, 268.0, 275.0, 282.0, 290.0],
		parametr_4 = [1.0, 0.97, 0.94, 0.91, 0.88, 0.85, 0.82, 0.79, 0.75, 0.7],
		parametr_range = 4,
		text = ["KEY_INCOME", "KEY_RELOAD"],
		data = ["income", "rof"],
		img = ["res://Assets/Icons/intensivity.png",
		"res://.godot/imported/reload.png-640ae2fae7d793eb56d026ec5a460b96.ctex"],
		strateg = true,
		queue_free = [2, 3]
	},
	6: {
		type = Rarity.COMMON,
		type_attack = 0,
		type_explosion = 0,
		cost_in_session = 100,
		parametr_1 = {
			1: [45.0, 72.0, 115.0, 184.0, 295.0, 475.0, 765.0, 1238.0, 2006.0, 3250.0],
			2: [45.0, 72.0, 115.0, 184.0, 295.0, 475.0, 765.0, 1238.0, 2006.0, 3250.0]
		},
		parametr_2 = {
			1: [45.0, 72.0, 115.0, 184.0, 295.0, 475.0, 765.0, 1238.0, 2006.0, 3250.0],
			2: [45.0, 72.0, 115.0, 184.0, 295.0, 475.0, 765.0, 1238.0, 2006.0, 3250.0]
		},
		parametr_3 = [245.0, 248.0, 251.0, 254.0, 257.0, 262.0, 268.0, 275.0, 282.0, 290.0],
		parametr_4 = [1.0, 0.97, 0.94, 0.91, 0.88, 0.85, 0.82, 0.79, 0.75, 0.7],
		parametr_range = 4,
		text = ["KEY_DAMAGE", "KEY_RELOAD", "KEY_RANGE", "KEY_DURATION", "KEY_TICK"],
		data = ["damage", "rof", "range", "duration", "tick"],
		img = ["res://.godot/imported/damage.png-872b5ccd784ae534d29ff2b790dfc3b4.ctex",
		"res://.godot/imported/reload.png-640ae2fae7d793eb56d026ec5a460b96.ctex", 
		"res://.godot/imported/range.png-d3745379c73ab4ee989b44544ccbbc0e.ctex",  
		"res://.godot/imported/duration.png-74d70b7c6b29a77461a04fd5357fe67f.ctex",
		"res://Assets/Icons/tick.png"],
		strateg = false,
		queue_free = []
	},
	7: {
		type = Rarity.COMMON,
		type_attack = 0,
		type_explosion = 0,
		cost_in_session = 100,
		parametr_1 = {
			1: [45.0, 72.0, 115.0, 184.0, 295.0, 475.0, 765.0, 1238.0, 2006.0, 3250.0],
			2: [45.0, 72.0, 115.0, 184.0, 295.0, 475.0, 765.0, 1238.0, 2006.0, 3250.0]
		},
		parametr_2 = {
			1: [45.0, 72.0, 115.0, 184.0, 295.0, 475.0, 765.0, 1238.0, 2006.0, 3250.0],
			2: [45.0, 72.0, 115.0, 184.0, 295.0, 475.0, 765.0, 1238.0, 2006.0, 3250.0]
		},
		parametr_3 = [245.0, 248.0, 251.0, 254.0, 257.0, 262.0, 268.0, 275.0, 282.0, 290.0],
		parametr_4 = [1.0, 0.97, 0.94, 0.91, 0.88, 0.85, 0.82, 0.79, 0.75, 0.7],
		parametr_range = 4,
		text = ["KEY_DAMAGE", "KEY_RELOAD", "KEY_RANGE", "KEY_DURATION", "KEY_TICK"],
		data = ["damage", "rof", "range", "duration", "tick"],
		img = ["res://.godot/imported/damage.png-872b5ccd784ae534d29ff2b790dfc3b4.ctex",
		"res://.godot/imported/reload.png-640ae2fae7d793eb56d026ec5a460b96.ctex", 
		"res://.godot/imported/range.png-d3745379c73ab4ee989b44544ccbbc0e.ctex",  
		"res://.godot/imported/duration.png-74d70b7c6b29a77461a04fd5357fe67f.ctex",
		"res://Assets/Icons/tick.png"],
		strateg = false,
		queue_free = []
	},
	8: {
		type = Rarity.COMMON,
		type_attack = 0,
		type_explosion = 0,
		cost_in_session = 100,
		parametr_1 = {
			1: [45.0, 72.0, 115.0, 184.0, 295.0, 475.0, 765.0, 1238.0, 2006.0, 3250.0],
			2: [45.0, 72.0, 115.0, 184.0, 295.0, 475.0, 765.0, 1238.0, 2006.0, 3250.0]
		},
		parametr_2 = {
			1: [45.0, 72.0, 115.0, 184.0, 295.0, 475.0, 765.0, 1238.0, 2006.0, 3250.0],
			2: [45.0, 72.0, 115.0, 184.0, 295.0, 475.0, 765.0, 1238.0, 2006.0, 3250.0]
		},
		parametr_3 = [245.0, 248.0, 251.0, 254.0, 257.0, 262.0, 268.0, 275.0, 282.0, 290.0],
		parametr_4 = [1.0, 0.97, 0.94, 0.91, 0.88, 0.85, 0.82, 0.79, 0.75, 0.7],
		parametr_range = 4,
		text = ["KEY_DAMAGE", "KEY_RELOAD", "KEY_RANGE", "KEY_DURATION", "KEY_TICK"],
		data = ["damage", "rof", "range", "duration", "tick"],
		img = ["res://.godot/imported/damage.png-872b5ccd784ae534d29ff2b790dfc3b4.ctex",
		"res://.godot/imported/reload.png-640ae2fae7d793eb56d026ec5a460b96.ctex", 
		"res://.godot/imported/range.png-d3745379c73ab4ee989b44544ccbbc0e.ctex",  
		"res://.godot/imported/duration.png-74d70b7c6b29a77461a04fd5357fe67f.ctex",
		"res://Assets/Icons/tick.png"],
		strateg = false,
		queue_free = []
	},
	9: {
		type = Rarity.COMMON,
		type_attack = 0,
		type_explosion = 0,
		cost_in_session = 100,
		parametr_1 = {
			1: [45.0, 72.0, 115.0, 184.0, 295.0, 475.0, 765.0, 1238.0, 2006.0, 3250.0],
			2: [45.0, 72.0, 115.0, 184.0, 295.0, 475.0, 765.0, 1238.0, 2006.0, 3250.0]
		},
		parametr_2 = {
			1: [45.0, 72.0, 115.0, 184.0, 295.0, 475.0, 765.0, 1238.0, 2006.0, 3250.0],
			2: [45.0, 72.0, 115.0, 184.0, 295.0, 475.0, 765.0, 1238.0, 2006.0, 3250.0]
		},
		parametr_3 = [245.0, 248.0, 251.0, 254.0, 257.0, 262.0, 268.0, 275.0, 282.0, 290.0],
		parametr_4 = [1.0, 0.97, 0.94, 0.91, 0.88, 0.85, 0.82, 0.79, 0.75, 0.7],
		parametr_range = 4,
		text = ["KEY_DAMAGE", "KEY_RELOAD", "KEY_RANGE", "KEY_DURATION", "KEY_TICK"],
		data = ["damage", "rof", "range", "duration", "tick"],
		img = ["res://.godot/imported/damage.png-872b5ccd784ae534d29ff2b790dfc3b4.ctex",
		"res://.godot/imported/reload.png-640ae2fae7d793eb56d026ec5a460b96.ctex", 
		"res://.godot/imported/range.png-d3745379c73ab4ee989b44544ccbbc0e.ctex",  
		"res://.godot/imported/duration.png-74d70b7c6b29a77461a04fd5357fe67f.ctex",
		"res://Assets/Icons/tick.png"],
		strateg = false,
		queue_free = []
	},
}
## Количество турелей в игре
const NUMBER_TURRET: int = 10
## Количество максимального уровня турелей в игре
const NUMBER_LVL_TURRET: int = 10
## Общее количество уровней
const NUMBER_LEVEL: int = 3
## Начальное количество денег/ресурсов на каждом уровне
const MONEY_BEGIN: Array = [400000, 10400, 800]
## Модификатор наград (например для подарков)
const MODIFIER_VALUE: float = 1.0
## Количество максимального уровня турелей путём улучшения карт
const NUMBER_LVL_TURRET_CARD: int = 9
## Количество боссов врагов
const NUMBER_BOSS_ENEMY: int = 1

const DATA_ENEMY_BOSS = {
	0: {
		hp = 1000,
		speed = 80,
		money_death = 20.0
		}
}
const TURRET_1_ABILITY_1: float = 0.03
const TURRET_3_ABILITY_0: float = 10
const TURRET_3_ABILITY_1: int = 3
const TURRET_4_ABILITY_0: int = 100
const TURRET_4_ABILITY_1: int = 20
